* Interesting links:

** Main nvidia container toolkit link:
https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html

* ENV Setup:

** APT stuff:

*** Update
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'apt-get' 'update'
#+end_src

*** Install Nvidia container toolkit:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'apt-get' 'install' '-y' 'nvidia-container-toolkit-base'
#+end_src

*** Check version:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'nvidia-ctk' '--version'
#+end_src

#+RESULTS:
: NVIDIA Container Toolkit CLI version 1.12.1

*** Generate configs:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'nvidia-ctk' 'cdi' 'generate' '--output=/etc/cdi/nvidia.yaml'
  'sudo' 'nvidia-ctk' 'cdi' 'generate' '--output=/var/run/cdi/nvidia.yaml'
#+end_src

#+RESULTS:

*** Check generated file:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'grep' '  name:' '/etc/cdi/nvidia.yaml'
#+end_src

#+RESULTS:
:   name: "0"
:   name: all

** For PODMAN:
(This section can be ignored for now...)

*** Install:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'apt-get' 'install' 'podman'
#+end_src

*** Run:
(Only works if podman version > 4.xx)
#+begin_src sh :shebang #!/usr/bin/sh :results output
'podman' 'run' '--rm' '--device' 'nvidia.com/gpu=all' 'ubuntu' 'nvidia-smi' '-L'
#+end_src

** Docker stuff:

*** Install
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'apt-get' 'install' 'docker'
#+end_src

*** Configure for docker:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'nvidia-ctk' 'runtime' 'configure' '--runtime=docker'
#+end_src

*** Restart docker:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'systemctl' 'restart' 'docker'
#+end_src


*** Search for images:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  sudo docker 'search' 'cuda'
#+end_src

*** Pull cuda 11.7 image:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  sudo docker 'pull' 'nvidia/cuda:11.7.1-devel-ubuntu22.04'
#+end_src

*** Test:

**** 1:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'docker' 'run' '--rm' '--runtime=nvidia' '--gpus' 'all' 'nvidia/cuda:11.6.2-base-ubuntu20.04' 'nvidia-smi'
#+end_src

**** 1:
#+begin_src sh :shebang #!/usr/bin/sh :results output
  'sudo' 'docker' 'run' '--rm' '--runtime=nvidia' '--gpus' 'all' 'nvidia/cuda:11.7.1-devel-ubuntu22.04' 'nvidia-smi'
#+end_src
